avr-rust/avrd/packs/tiny/ATtiny40.atdf
      <value-group caption="" name="ANALOG_ADC_V_REF">
        <value caption="Vcc used as internal reference" name="VAL_0x00" value="0x00"/>
        <value caption="Internal 1.1V Referemce" name="VAL_0x01" value="0x01"/>
      </value-group>
      <value-group caption="" name="ADC_MUX">
        <value caption="ADC0" name="ADC0" value="0x00"/>
        <value caption="ADC1" name="ADC1" value="0x01"/>
        <value caption="ADC2" name="ADC2" value="0x02"/>
        <value caption="ADC3" name="ADC3" value="0x03"/>
        <value caption="ADC4" name="ADC4" value="0x04"/>
        <value caption="ADC5" name="ADC5" value="0x05"/>
        <value caption="ADC6" name="ADC6" value="0x06"/>
        <value caption="ADC7" name="ADC7" value="0x07"/>
        <value caption="ADC8" name="ADC8" value="0x08"/>
        <value caption="ADC9" name="ADC9" value="0x09"/>
        <value caption="ADC10" name="ADC10" value="0x0A"/>
        <value caption="ADC11" name="ADC11" value="0x0B"/>
        <value caption="0V (AGND)" name="ADC_GND" value="0x0C"/>
        <value caption="1.1V Internal Reference" name="ADC_VBG" value="0x0D"/>
        <value caption="Temperature sensor" name="TEMPSENS" value="0x0E"/>
      </value-group>
      <value-group caption="" name="ANALOG_ADC_PRESCALER">
        <value caption="2" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER3">
        <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
        <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
        <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
        <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
        <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
        <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
        <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
        <value caption="Watchdog Interrupt Request" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Analog Comparator" name="AC">
      <register-group caption="Analog Comparator" name="AC">
        <register caption="Analog Comparator Control And Status Register B" name="ACSRB" offset="0x13" size="1">
          <bitfield caption="Hysteresis Select" mask="0x80" name="HSEL"/>
          <bitfield caption="Hysteresis Level" mask="0x40" name="HLEV"/>
          <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x04" name="ACME"/>
        </register>
        <register caption="Analog Comparator Control And Status Register A" name="ACSRA" offset="0x14" size="1">
          <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
          <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
          <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
          <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
          <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
          <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
          <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS" values="ANALOG_COMP_INTERRUPT"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_COMP_INTERRUPT">
        <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="Two Wire Serial Interface" name="TWI">
      <register-group caption="Two Wire Serial Interface" name="TWI">
        <register caption="TWI Slave Control Register A" name="TWSCRA" offset="0x2D" size="1">
          <bitfield caption="TWI SDA Hold Time Enable" mask="0x80" name="TWSHE"/>
          <bitfield caption="TWI Data Interrupt Enable" mask="0x20" name="TWDIE"/>
          <bitfield caption="TWI Address/Stop Interrupt Enable" mask="0x10" name="TWASIE"/>
          <bitfield caption="Two-Wire Interface Enable" mask="0x08" name="TWEN"/>
          <bitfield caption="TWI Stop Interrupt Enable" mask="0x04" name="TWSIE"/>
          <bitfield caption="TWI Promiscuous Mode Enable" mask="0x02" name="TWPME"/>
          <bitfield caption="TWI Smart Mode Enable" mask="0x01" name="TWSME"/>
        </register>
        <register caption="TWI Slave Control Register B" name="TWSCRB" offset="0x2C" size="1">
          <bitfield caption="TWI Acknowledge Action" mask="0x04" name="TWAA"/>
          <bitfield caption="" mask="0x03" name="TWCMD"/>
        </register>
        <register caption="TWI Slave Status Register A" name="TWSSRA" offset="0x2B" size="1" mask="0xFF"/>
        <register caption="TWI Slave Address Register" name="TWSA" offset="0x2A" size="1" ocd-rw="R">
          <bitfield caption="TWI slave address bit" mask="0xFF" name="TWSA"/>
        </register>
        <register caption="TWI Slave Data Register" name="TWSD" offset="0x28" size="1" ocd-rw="R">
          <bitfield caption="TWI slave data bit" mask="0xFF" name="TWSD"/>
        </register>
        <register caption="TWI Slave Address Mask Register" name="TWSAM" offset="0x29" size="1" mask="0xFF"/>
      </register-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Configuration Change Protection" name="CCP" offset="0x3C" size="1" mask="0xFF"/>
        <register caption="Stack Pointer " name="SP" offset="0x3D" size="2" mask="0xFFFF"/>
        <register caption="Status Register" name="SREG" offset="0x3F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Clock Main Settings Register" name="CLKMSR" offset="0x37" size="1">
          <bitfield caption="Clock Main Select Bits" mask="0x03" name="CLKMS"/>
        </register>
        <register caption="Clock Prescale Register" name="CLKPSR" offset="0x36" size="1">
          <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
        </register>
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x39" size="1" mask="0xFF">
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="Power Reduction Register" name="PRR" offset="0x35" size="1">
          <bitfield caption="Power Reduction TWI" mask="0x10" name="PRTWI"/>
          <bitfield caption="Power Reduction Serial Peripheral Interface" mask="0x08" name="PRSPI"/>
          <bitfield caption="Power Reduction Timer/Counter1" mask="0x04" name="PRTIM1"/>
          <bitfield caption="Power Reduction Timer/Counter0" mask="0x02" name="PRTIM0"/>
          <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
        </register>
        <register caption="Reset Flag Register" name="RSTFLR" offset="0x3B" size="1">
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on Reset Flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Non-Volatile Memory Control and Status Register" name="NVMCSR" offset="0x32" size="1">
          <bitfield caption="Non-Volatile Memory Busy" mask="0x80" name="NVMBSY"/>
        </register>
        <register caption="Non-Volatile Memory Command" name="NVMCMD" offset="0x33" size="1" mask="0x3F"/>
