avr-rust/avrd/packs/tiny/ATtiny40.atdf
        <register caption="MCU Control Register" name="MCUCR" offset="0x3A" size="1" mask="0xDF">
          <bitfield caption="BOD Sleep" mask="0x10" name="BODS"/>
          <bitfield caption="Sleep Mode" mask="0x0E" name="SM" values="CPU_SLEEP_MODE"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
        </register>
        <register caption="RAM Address Register" name="RAMAR" offset="0x20" size="1" mask="0xFF"/>
        <register caption="RAM Data Register" name="RAMDR" offset="0x1F" size="1" mask="0xFF"/>
      </register-group>
      <value-group caption="Sleep Mode" name="CPU_SLEEP_MODE">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC noise reduction" name="ADC" value="0x01"/>
        <value caption="Power-down" name="PDOWN" value="0x02"/>
        <value caption="Standby" name="STDBY" value="0x04"/>
      </value-group>
      <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
        <value caption="256" name="VAL_0x08" value="0x08"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
      </value-group>
      <parameters>
        <param name="CORE_VERSION" value="AVR8L_0"/>
      </parameters>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
	      <register caption="MCU Control Register" name="MCUCR" offset="0x3A" size="1">
		      <bitfield caption="Interrupt Sense Control 0 Bit 1" mask="0x80" name="ISC01"/>
		      <bitfield caption="Interrupt Sense Control 0 Bit 0" mask="0x40" name="ISC00" values="INTERRUPT_SENSE_CONTROL"/>
	      </register>
        <register caption="General Interrupt Mask Register" name="GIMSK" offset="0x0C" size="1" mask="0x71">
          <bitfield caption="External Interrupt Request 0 Enable" mask="0x01" name="INT0"/>
          <bitfield caption="Pin Change Interrupt Enables" mask="0x70" name="PCIE"/>
        </register>
        <register caption="General Interrupt Flag Register" name="GIFR" offset="0x0B" size="1" mask="0x71">
          <bitfield caption="External Interrupt Flag 0" mask="0x01" name="INTF0"/>
          <bitfield caption="Pin Change Interrupt Flags" mask="0x70" name="PCIF"/>
        </register>
        <register caption="Pin Change Mask Register 2" name="PCMSK2" offset="0x1A" size="1">
          <bitfield caption="Pin Change Enable Mask 3" mask="0x3F" name="PCINT" lsb="12"/>
        </register>
        <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x0A" size="1">
          <bitfield caption="Pin Change Enable Mask 3" mask="0x0F" name="PCINT" lsb="8"/>
        </register>
        <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x09" size="1">
          <bitfield caption="Pin Change Enable Mask 3" mask="0xFF" name="PCINT"/>
        </register>
      </register-group>
      <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
        <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
        <value caption="Any logical change on INTX" name="VAL_0x01" value="0x01"/>
        <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
        <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port Control Register" name="PORTCR" offset="0x08" size="1">
          <bitfield caption="" mask="0x80" name="ADC11D"/>
          <bitfield caption="" mask="0x40" name="ADC10D"/>
          <bitfield caption="" mask="0x20" name="ADC9D"/>
          <bitfield caption="" mask="0x10" name="ADC8D"/>
          <bitfield caption="Break-Before-Make Mode Enable" mask="0x04" name="BBMC"/>
          <bitfield caption="Break-Before-Make Mode Enable" mask="0x02" name="BBMB"/>
          <bitfield caption="Break-Before-Make Mode Enable" mask="0x01" name="BBMA"/>
        </register>
        <register caption="Pull-up Enable Control Register" name="PUEB" offset="0x07" size="1" mask="0x0F"/>
        <register caption="Data Direction Register, Port B" name="DDRB" offset="0x05" size="1" mask="0x0F"/>
        <register caption="Port B Data register" name="PINB" offset="0x04" size="1" mask="0x0F"/>
        <register caption="Input Pins, Port B" name="PORTB" offset="0x06" size="1" mask="0x0F"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTC">
        <register caption="Port Control Register" name="PORTCR" offset="0x08" size="1">
          <bitfield caption="" mask="0x80" name="ADC11D"/>
          <bitfield caption="" mask="0x40" name="ADC10D"/>
          <bitfield caption="" mask="0x20" name="ADC9D"/>
          <bitfield caption="" mask="0x10" name="ADC8D"/>
          <bitfield caption="Break-Before-Make Mode Enable" mask="0x04" name="BBMC"/>
        </register>
        <register caption="Pull-up Enable Control Register" name="PUEC" offset="0x1E" size="1" mask="0x3F"/>
        <register caption="Port C Data Register" name="PORTC" offset="0x1D" size="1" mask="0x3F"/>
        <register caption="Data Direction Register, Port C" name="DDRC" offset="0x1C" size="1" mask="0x3F"/>
        <register caption="Port C Input Pins" name="PINC" offset="0x1B" size="1" mask="0x3F"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTA">
        <register caption="Port Control Register" name="PORTCR" offset="0x08" size="1">
          <bitfield caption="Break-Before-Make Mode Enable" mask="0x01" name="BBMA"/>
        </register>
